### 3.9 Практика: вытягиваем нужное, удаляем ненужное

In [70]:
import pandas as pd
import numpy as np

data = [['Ivan', 25, 4, 50, 1], 

        ['Petr', 40, 9, 250, 8], 

        ['Nikolay', 19, 12, 25, 1], 

        ['Sergey', 33, 6, 115, 6],

        ['Andrey', 38, 2, 152, 4],

        ['Ilya', 20, 18, 15, 2],

        ['Igor', 19, 2, 10, 1]]

_df = pd.DataFrame(data, columns=['user_name', 'user_age', 'user_clicks', 'user_balance', 'user_history'], index=list('abcdefg'))

#### На вход подаётся датафрейм:

In [54]:
_df

  user_name  user_age  user_clicks  user_balance  user_history
a      Ivan        25            4            50             1
b      Petr        40            9           250             8
c   Nikolay        19           12            25             1
d    Sergey        33            6           115             6
e    Andrey        38            2           152             4
f      Ilya        20           18            15             2
g      Igor        19            2            10             1

#### 3. Удалите из названий колонок префикс user_. Функция должна вернуть датафрейм с названием колонок без префикса user_:

In [55]:
#Решение 1:
def solution(_df):
    dd = dict()
    for x in _df.columns:
        dd[x] = x.replace('user_', '')
    _df = _df.rename(columns = dd)
    return _df

In [71]:
_df = solution(_df)

In [72]:
_df

      name  age  clicks  balance  history
a     Ivan   25       4       50        1
b     Petr   40       9      250        8
c  Nikolay   19      12       25        1
d   Sergey   33       6      115        6
e   Andrey   38       2      152        4
f     Ilya   20      18       15        2
g     Igor   19       2       10        1

In [7]:
#2
def solution(_df):
    _df.columns = _df.columns.str.replace('user_', '')
    return _df

#### 4. Выполните реиндекс строк таким образом, чтобы остались только строчки с лейблами, которые перечислены в листе

In [8]:
_df.reindex(['a', 'f', 'g'])

   name  age  clicks  balance  history
a  Ivan   25       4       50        1
f  Ilya   20      18       15        2
g  Igor   19       2       10        1

#### 5. Удалите из датафрейма строчки c лейблами c, f, g и колонку c лейблом history. Верните итоговый датафрейм.

In [9]:
_df.drop(columns = 'history', index = ['c', 'f', 'g'])

     name  age  clicks  balance
a    Ivan   25       4       50
b    Petr   40       9      250
d  Sergey   33       6      115
e  Andrey   38       2      152

#### 6. Вытяните столбцы name, age, balance. Функция должна вернуть датафрейм:

In [10]:
_df.reindex(columns = ['name', 'age', 'balance'])

      name  age  balance
a     Ivan   25       50
b     Petr   40      250
c  Nikolay   19       25
d   Sergey   33      115
e   Andrey   38      152
f     Ilya   20       15
g     Igor   19       10

#### 7. Вытяните последние три строки со столбцами name и balance Функция должна вернуть итоговый датафрейм:

In [11]:
_df[-3::1][['name', 'balance']]

     name  balance
e  Andrey      152
f    Ilya       15
g    Igor       10

#### 8. Выведите только тех пользователей, которые старше 30 лет:

In [13]:
_df[_df['age'] > 30]

     name  age  clicks  balance  history
b    Petr   40       9      250        8
d  Sergey   33       6      115        6
e  Andrey   38       2      152        4

#### 9. Выведите пользователей, которые младше 30 лет и баланс больше 20:

In [14]:
#1
_df[(_df['age'] < 30) & (_df['balance'] > 20)]

      name  age  clicks  balance  history
a     Ivan   25       4       50        1
c  Nikolay   19      12       25        1

In [15]:
#2
_df.query('age < 30 & balance > 20')

      name  age  clicks  balance  history
a     Ivan   25       4       50        1
c  Nikolay   19      12       25        1

####  10. Определите пользователей у которых баланс больше 100. Возьмите две колонки name и age, а затем отдайте получившийся датафрейм на проверку:

In [33]:
_df[_df['balance'] > 100][['name', 'age']]

     name  age
b    Petr   40
d  Sergey   33
e  Andrey   38

#### 11. Выберите из датафрейма записи, если имя пользователя Petr или Andrey. От получившегося датафрейма возьмите три столбца: name, age, balance:

In [40]:
#1
_df[(_df['name'] == 'Petr') | (_df['name'] == 'Andrey')][['name', 'age', 'balance']]

     name  age  balance
b    Petr   40      250
e  Andrey   38      152

In [38]:
#2
_df[_df.name.isin(['Petr', 'Andrey'])][['name', 'age', 'balance']]

     name  age  balance
b    Petr   40      250
e  Andrey   38      152

#### 12. В компании было принято решение обнулить баланс для пользователей у которых баланс меньше 100. Вы были выбраны исполнителем. Отредактируйте колонку balance.

In [74]:
#1
_df['balance'] = np.where(_df['balance'] < 100, 0, _df['balance'])

In [75]:
_df

      name  age  clicks  balance  history
a     Ivan   25       4        0        1
b     Petr   40       9      250        8
c  Nikolay   19      12        0        1
d   Sergey   33       6      115        6
e   Andrey   38       2      152        4
f     Ilya   20      18        0        2
g     Igor   19       2        0        1

In [76]:
#2
#df.loc[df['balance'] < 100, 'balance'] = 0